Revit 2027 API
ElectricalLoadAreaData Class
 Represents the electrical load area data.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpatialElementDomainData
 Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElectricalLoadAreaData : SpatialElementDomainData
Public Class ElectricalLoadAreaData
	Inherits SpatialElementDomainData
public ref class ElectricalLoadAreaData : public SpatialElementDomainData
type ElectricalLoadAreaData =
    class
        inherit SpatialElementDomainData
    end
The ElectricalLoadAreaData type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from SpatialElementDomainData)
Top
Methods
Name | Description
CreateElectricalLoadAreas |  Creates electrical load areas on all the empty plan circuits of the given level.
Dispose
(Inherited from SpatialElementDomainData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAreaBasedLoadIds |  Gets the area based load ids of the electrical load area to be included.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasCircuitsWithoutElectricalLoadAreas |  Checks whether there are any empty plan circuits in which there are no electrical load areas.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace